title: Another Test rule
id: 5013332f-8a70-4e04-bcc1-06a98a2cca3f
description: it is a valid rule
status: stable
level: high
date: 2023-12-09
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\abc.exe'
  condition: selection
tags:
  - attack.t1505.003
